In [1]:
import pandas as pd

In [2]:
df = pd.read_csv(r"C:\Users\LENOVO\Desktop\VS Code\ML Projects\Code_basics-ML-Tutorial\titanic.csv")

In [3]:
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [15]:
target = df['Survived']
df.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)

input = df.drop('Survived',axis ='columns')
dummies = pd.get_dummies(input.Sex)

In [16]:
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [17]:
input = pd.concat([input,dummies],axis = 'columns')

In [18]:
input.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [22]:
input.columns[input.isna().any()]

Index(['Age'], dtype='object')

In [24]:
input.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [26]:
input.Age = input.Age.fillna(input.Age.mean())
input.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [32]:
input.drop(['Sex','male'],axis='columns',inplace=True)
input.head(3)

   Pclass   Age     Fare  female
0       3  22.0   7.2500       0
1       1  38.0  71.2833       1
2       3  26.0   7.9250       1

In [33]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(input,target,test_size=0.3)

In [34]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()

In [35]:
model.fit(X_train,y_train)

GaussianNB()

In [36]:
X_test[0:10]

     Pclass        Age      Fare  female
878       3  29.699118    7.8958       0
323       2  22.000000   29.0000       1
887       1  19.000000   30.0000       1
553       3  22.000000    7.2250       0
311       1  18.000000  262.3750       1
306       1  29.699118  110.8833       1
524       3  29.699118    7.2292       0
231       3  29.000000    7.7750       0
605       3  36.000000   15.5500       0
412       1  33.000000   90.0000       1

In [37]:
y_test[0:10]

878    0
323    1
887    1
553    1
311    1
306    1
524    0
231    0
605    0
412    1
Name: Survived, dtype: int64

In [38]:
model.predict(X_test[0:10])

array([0, 1, 1, 0, 1, 1, 0, 0, 0, 1], dtype=int64)

In [39]:
model.predict_proba(X_test[:10])

array([[9.65099282e-01, 3.49007179e-02],
       [2.18452799e-01, 7.81547201e-01],
       [7.84773183e-02, 9.21522682e-01],
       [9.59719281e-01, 4.02807193e-02],
       [8.00586072e-11, 1.00000000e+00],
       [4.94169629e-03, 9.95058304e-01],
       [9.64991118e-01, 3.50088818e-02],
       [9.64736564e-01, 3.52634364e-02],
       [9.67664741e-01, 3.23352591e-02],
       [1.71448232e-02, 9.82855177e-01]])

In [42]:
model.score(X_test,y_test)

0.7798507462686567